----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1            [-1, 8, 40, 98]              80
               ELU-2            [-1, 8, 40, 98]               0
         MaxPool2d-3            [-1, 8, 21, 50]               0
         Dropout2d-4            [-1, 8, 21, 50]               0
            Conv2d-5           [-1, 16, 21, 50]           1,168
               ELU-6           [-1, 16, 21, 50]               0
         MaxPool2d-7           [-1, 16, 11, 26]               0
         Dropout2d-8           [-1, 16, 11, 26]               0
            Conv2d-9           [-1, 32, 11, 26]           4,640
              ELU-10           [-1, 32, 11, 26]               0
        MaxPool2d-11            [-1, 32, 6, 14]               0
        Dropout2d-12            [-1, 32, 6, 14]               0
           Conv2d-13            [-1, 64, 6, 14]          18,496
              ELU-14            [-1, 64, 6, 14]               0
        MaxPool2d-15             [-1, 64, 4, 8]               0
          Flatten-16                 [-1, 2048]               0
           Linear-17                  [-1, 128]         262,272
              ELU-18                  [-1, 128]               0
          Dropout-19                  [-1, 128]               0
           Linear-20                   [-1, 14]           1,806
          Softmax-21                   [-1, 14]               0
================================================================
Total params: 288,462
Trainable params: 288,462
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.01
Forward/backward pass size (MB): 1.23
Params size (MB): 1.10
Estimated Total Size (MB): 2.35
----------------------------------------------------------------
