----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1            [-1, 8, 40, 98]              80
               ELU-2            [-1, 8, 40, 98]               0
         MaxPool2d-3            [-1, 8, 20, 49]               0
            Conv2d-4           [-1, 16, 20, 49]           1,168
               ELU-5           [-1, 16, 20, 49]               0
         MaxPool2d-6           [-1, 16, 10, 24]               0
            Conv2d-7           [-1, 32, 10, 24]           4,640
               ELU-8           [-1, 32, 10, 24]               0
         MaxPool2d-9            [-1, 32, 5, 12]               0
           Conv2d-10            [-1, 64, 5, 12]          18,496
              ELU-11            [-1, 64, 5, 12]               0
        MaxPool2d-12             [-1, 64, 2, 6]               0
          Flatten-13                  [-1, 768]               0
           Linear-14                  [-1, 128]          98,432
              ELU-15                  [-1, 128]               0
           Linear-16                    [-1, 6]             774
           Linear-17                   [-1, 14]              98
          Softmax-18                   [-1, 14]               0
================================================================
Total params: 123,688
Trainable params: 123,688
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.01
Forward/backward pass size (MB): 1.01
Params size (MB): 0.47
Estimated Total Size (MB): 1.50
----------------------------------------------------------------
